In [26]:
import pandas as pd

In [36]:
employee_data = {
    "id": [1, 2, 3, 4],
    "name": ["Joe", "Henry", "Sam", "Max"],
    "salary": [70000, 80000, 60000, 90000],
    "managerId": [3, 4, None, None]
}

In [37]:
employe_df = pd.DataFrame(employee_data)
employe_df

   id   name  salary  managerId
0   1    Joe   70000        3.0
1   2  Henry   80000        4.0
2   3    Sam   60000        NaN
3   4    Max   90000        NaN

In [38]:
result_df = pd.merge(employe_df, employe_df, left_on='managerId', right_on='id', how='left', suffixes=('', '_manager'))
result_df

,id,name,salary,managerId,id_manager,name_manager,salary_manager,managerId_manager
0,1,Joe,70000,3.0,3.0,Sam,60000.0,NaN
1,2,Henry,80000,4.0,4.0,Max,90000.0,NaN
2,3,Sam,60000,NaN,NaN,NaN,NaN,NaN
3,4,Max,90000,NaN,NaN,NaN,NaN,NaN

In [39]:
result_df = result_df[result_df["salary"] > result_df["salary_manager"]]
result_df

,id,name,salary,managerId,id_manager,name_manager,salary_manager,managerId_manager
0,1,Joe,70000,3.0,3.0,Sam,60000.0,NaN

In [40]:
result_df = result_df[["name"]].rename(columns={'name': "Employee"})
result_df

  Employee
0      Joe

In [41]:
def find_employees(employee: pd.DataFrame) -> pd.DataFrame:
    result_df = pd.merge(employee, employee, left_on='managerId', right_on='id', how='left', suffixes=('', '_manager'))
    result_df = result_df[result_df["salary"] > result_df["salary_manager"]]
    result_df = result_df[["name"]].rename(columns={'name': 'Employee'})
    return result_df